counting = 0

start = 'Привет, это Бот с кроссвордами по философии.\nВыбирай тему и начинай решать!'

rules = '1. Чтобы начать решать кроссворд, напишите слово "Начнем"\n2. Пишите слова с большой буквы и указывайте ' \
        'номер слова, например: "1. Философия"\n3. Наслаждайтесь'

questions1 = f"\nПо горизонтали:\n\n5. В религиозно-философском смысле: присутствие божественного в человеке, " \
             f"свойство души человека быть образом божественного Духа.\n6. Нравственность, один из способов " \
             f"нормативной регуляции поведения людей в обществе.\n7. Одна из форм общественного сознания — " \
             f"совокупность представлений, основанных на вере в существование высших сил и существ (Бога и богов), " \
             f"которые являются предметом поклонения.\n\nПо вертикали:\n\n1. Множество людей, характеризующийся " \
             f"общностью социальной, экономической и культурной жизни.\n2. Регулятор общественных отношений, " \
             f"совокупность законодательных норм, юридическая составляющая жизни общества.\n3. Чувство и сознание " \
             f"моральной ответственности за своё поведение и моральности своих поступков перед самим собой и перед " \
             f"другими.\n4. Образ мышления, мировосприятия, присущие индивиду или группе."

answers1 = ['1. Социум', '2. Право', '3. Совесть', '4. Менталитет', '5. Духовность', '6. Мораль', '7. Религия']

coordinates1 = [(1, 0, "v", 6), (3, 0, "v", 5), (7, 0, "v", 7), (5, 2, "v", 10), (0, 4, "g", 10), (2, 6, "g", 6),
                (2, 8, "g", 7)]

cs = [coordinates1]
